# Pandas

#### Pandas從NumPy採用了許多寫程式的習慣，不同在於它是被設計來處理表格式和異值資料集，相對來說NumPy適用於同質的數值陣列資料。
#### Pandas擁有的資料結構和資料操作工具，讓Python中資料清理和分析快又輕鬆，常與NumPy或SciPy等數值計算工具結合使用，也常與statsmodels或scikit-learn等資料分析函式庫一起使用。

### 引用慣例:

In [1]:
import pandas as pd

### Series和DataFrame也很常用到:

In [2]:
from pandas import Series,DataFrame

#### Series和DataFrame為兩基本資料結構，兩者提供許多有效且容易使用的基礎功能。

***

## Series

#### Series是一個長的像一維陣列的物件，含有一個值得序列(型態與NumPy相似)以及一個資料標籤 index陣列。

### 最簡單的Series是由一個陣列資料組成:

In [4]:
obj=pd.Series([4,7,-5,3])

In [5]:
obj #左側為 index，右側為值。由於未設定 index 值，index值會預設從 0 開始到 N-1。 N->資料總個數。

0    4
1    7
2   -5
3    3
dtype: int64

### 可透過values和index屬性，分別取得值和index陣列:

In [7]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [8]:
obj.index #值相同於range(4)

RangeIndex(start=0, stop=4, step=1)

### 為Series每個資料點建立index:

In [27]:
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [28]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [29]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

***

### 與NumPy陣列一樣，可將標籤寫在索引處取得一個值或一個值得集合:

In [30]:
obj2['a']

-5

In [31]:
obj2['d']

4

In [34]:
obj2[['c','a','b']] #['c','a','b']是字串不是整數，但也是合法的index值。

c    3
a   -5
b    7
dtype: int64

***

### 布林陣列過去資料、純量乘法或使用數學函式，有用到NumPy函式或類似NumPy運算，都會保存期index和值的連結關係:

In [37]:
obj2[obj2>2]

d    4
b    7
c    3
dtype: int64

In [38]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [39]:
import numpy as np

In [41]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

***

#### 另一個理解Series的方式，是把它當成一個固定長度，有次序的字典型態，因為它的index和值都是成對出現。
### 使用方法和使用字典型態是一樣的:

In [42]:
'b' in obj2

True

In [43]:
'e' in obj2

False

### 假設你資料原本是存放在Python dict型態中，可用它建立Series:

In [44]:
sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [45]:
obj3=pd.Series(sdata)

In [46]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

#### 當只傳遞一個字典型態物件時，產生的Series中資料是以該字典的key排序。

### 可將字典的key另外傳入，改變產出Series的順序:

In [51]:
states=['California','Ohio','Oregon','Texas']

In [52]:
obj4=pd.Series(sdata,index=states)

In [53]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

#### 上面的Series中的index和新的index匹配，換成指定的位置，不過由於'California'沒有相對地值，所以顯示NaN。另外，由於'Utah'不再states中，所以被刪去了。

***

#### NaN在pandas中表示為遺失或NA值，同於資料遺失的意思。
### isnull和notnull可用來偵測遺失資料:

In [54]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [57]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [55]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [56]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

#### Series物件本身也有同樣的實例方法:

In [59]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

***

### Series有個實用的功能，搭配運算時，能自動以index對齊:

In [60]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [61]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [63]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

#### 這類資料對齊的功能，類似資料庫中的 結合( join ) 功能。

***

### Series物件和它內部的index都有name屬性，可和其他的pandas功能合併使用:

In [64]:
obj4.name='population' # Series物件obj4命名

In [65]:
obj4.index.name='state' # index 命名

In [66]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

***

### Series中的index可用給值的方法直接修改:

In [67]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [68]:
obj.index=['Bob','Steve','Jeff','Ryan']

In [69]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

***

## DataFrame

#### 一個DataFrame代表一個含有資料的方形資料表，其中包括一維欄位，每個欄位可能是不同的形態(數字、字串、布林等)。
#### DataFrame有 row 和 column index，可想像成一個裝了很多Series物件的dict物件，每個Series都使用一樣column index。
#### 在底層，資料並不是使用list、dict或其他一維陣列等型態儲存，而是用一或多個二維區塊儲存。
#### DataFrame實際上是二維的，但可用表格格式搭配階層索引表示更高維度的資料。

### 建立DataFrame方法有很多種，最常見是用裝在等長list物件的dict或用NumPy陣列建立:

In [4]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [5]:
frame=pd.DataFrame(data)

### 建出來的DataFrame和Series一樣，會被自動指派index值，且欄位裡的值會被派好:

In [6]:
frame #jupyter notebook 會用適合瀏覽器的html格式顯示

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

***

### 碰到大型DaaFrame，可用head方法來選取開頭幾個row就好:

In [8]:
frame.head(3) #前 3 row

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

***

### 欄位以序列指定的話，DataFrame的欄位會按指定順序排好:

In [9]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

### 也可指定index。然而，當傳入的欄位不存在dict裡的話，會以NaN方式顯示:

In [13]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                   index=['one','two','three','four','five','six'])

In [14]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [15]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

***

### DataFrame欄位中可用類似操作dict的方法或屬性，指定取回，型態為Series:

In [16]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [17]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

### 資料列也可透過特殊的 loc屬性 ，指定位置或名稱取回:

In [18]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

***

### 給值動作可修改欄中的值，可指定常數值或陣列值:

In [22]:
frame2['debt']=16.5 #常數值

In [23]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [25]:
import numpy as np

In [26]:
frame['debt']=np.arange(6.) #給陣列值

In [27]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

#### 當把一個 list 或陣列指定給一欄時，元素的數量必須要和DataFrame的元素數量一樣。

### 若是是把Series值指定給欄時，Series的index標籤會自動對齊DataFrame中的index，未能匹配的部分填充NAN:

In [28]:
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [29]:
frame2['debt']=val

In [30]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

### 對一個不存在的欄位給值的話，會自動創建新的欄位:

In [33]:
frame2['eastern']=frame2.state=='Ohio' # 加入一欄，型態為布林，代表state中欄位的值是否為'Ohio'

In [34]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

#### frame2.eastern這樣的語法不能建立新欄

### del關鍵字 可用dict的方法刪除一欄:

In [36]:
del frame2['eastern']

In [37]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

#### 對DataFrame進行索引回傳的欄是一個底下資料的view，沒有真的進行複製的動作。也就是說，對該回傳的Series進行的修改，都會影響DataFrame中的資料。若要進行複製，可以指定Series的copy方法。

***

### 另一個資料常見的形式，是dict中又包含dict的巢式結構:

In [38]:
pop={'Neveda':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [39]:
pop

{'Neveda': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

### 若把巢式的dict傳入DataFrame的話，pandas會把外層的 dict key 解讀為 column index，內層的 dict key 解讀成 row indeex:

In [40]:
frame3=pd.DataFrame(pop)

In [41]:
frame3

      Neveda  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

### 可轉置一個DataFrame，語法和NumPy差不多:

In [42]:
frame3.T

        2000  2001  2002
Neveda   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

***

### 若DataFrame已設定index和columns的name屬性的話，這些資訊也會被顯示出來:

In [47]:
frame3.index.name='year';frame3.columns.name='state'

In [48]:
frame3

state  Neveda  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

### 同Series的values屬性一樣，DataFrame的values屬性為以一個二維的ndarray回傳DataFrame裡的資料:

In [52]:
frame3

state  Neveda  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [49]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

### 若DataFrame的欄位dtype不同，選定可滿足所有欄位的dtype:

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [51]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

![jupyter](./可傳遞給DataFrame建構子的資料.PNG)

***

## Index物件

#### pandas的index物件負責裝載軸標籤以及其他的metadata。

### 建立一個Series或DataFrame時使用的標籤陣列或序列會被轉成index物件:

In [56]:
obj=pd.Series(range(3),index=['a','b','c'])

In [57]:
index=obj.index

In [58]:
index

Index(['a', 'b', 'c'], dtype='object')

In [59]:
index[1:]

Index(['b', 'c'], dtype='object')

### index物件是immutable，使用者不可改變它的值。
### 不可改變的特性，讓它再搭配其他資料結構使用時更方便:

In [60]:
labels=pd.Index(range(3))

In [61]:
labels

RangeIndex(start=0, stop=3, step=1)

In [62]:
list(labels)

[0, 1, 2]

In [64]:
obj2=pd.Series([1.5,-2.5,0],index=labels)

In [66]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [68]:
obj2.index is labels

True

### index特性除了像陣列外，也可像固定長度的set一樣:

In [69]:
frame3

state  Neveda  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [70]:
frame3.columns

Index(['Neveda', 'Ohio'], dtype='object', name='state')

In [71]:
'Ohio' in frame3.columns

True

In [72]:
2003 in frame3.index

False

### pandas的Index物件和Python的set不同在於它可有重複的標籤:

In [73]:
dup_labels=pd.Index(['foo','foo','bar','bar'])

In [74]:
dup_labels #會有重複

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

#### 若選中重複標籤其中之一時，也表示選中所有重複標籤。

![jupyter](./部分Index方法和屬性.PNG)

***

## 重做索引

### reindex，建立新物件時，附帶新索引資料。
### 呼叫Series的reindex方法，將會用新的index重排資料，若任何新的index無法匹配既有的index，值會被設定為NA:

In [3]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [4]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2=obj.reindex(['a','b','c','d','e'])

In [6]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

### 像時間序列這種有順序的資料，做reindex時可能會想做一些內插或是填值的動作，此時 method參數 就派上用場:

In [7]:
obj3=Series(['blue','purple','yellow'],index=[0,2,4])

In [8]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [9]:
# method 參數 設定為 ffill，會參考前面的值填值:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### 如果是DataFrame物件，可以對row、columns或兩者同時進行reindex。
### 若單純船一個序列的話，重做索引的對象為row:

In [11]:
import numpy as np

In [12]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [13]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [16]:
frame2=frame.reindex(['a','b','c','d'])

In [17]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

### 用columns關鍵字可指定對columns重做索引:

In [18]:
states=['Texas','Utah','California']

In [20]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 可搭配 loc 使用標籤index更簡潔地重做索引:

In [21]:
frame.loc[['a','b','c','d'],states]

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

![jupyter](./reindex函式參數.PNG)

***

## 指定軸刪除資料

### 若已擁有刪去某一或多個軸的index陣列的話，要刪去某一軸或多個軸的資料就很容易。如果要搭配清理或邏輯使用的話，可使用drop，它會回傳一個刪去特定軸資料的新物件:

In [24]:
obj=pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [25]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [26]:
new_obj=obj.drop('c')

In [27]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [30]:
obj.drop(['d','e'])

a    0
b    1
c    2
dtype: int32

### DataFrame物件的兩個軸都可用指定index的方法刪除資料:

In [32]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [33]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data.drop(['Colorado','Ohio']) # 軸 0

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data.drop('two',axis=1) # axis=1 或 axis='columns'可刪去指定欄的資料

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [37]:
data.drop('three',axis='columns')

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
New York   12   13    15

### 像是drop這類會改變原來Series或DataFrame的函式，都可指定in-place的方法來修改資料，不建立新物件:

In [38]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [39]:
obj.drop('c',inplace=True)

In [40]:
obj

a    0
b    1
d    3
e    4
dtype: int32

#### 指定inplace時要小心，它會抹去刪除的資料。

***

## 索引、選擇和過濾

### Series做索引(obj[...])的動作和NumPy陣列的索引很類似，差別在Series能用index值，不一定要用整數:

In [41]:
obj=pd.Series(np.arange(4),index=['a','b','c','d'])

In [42]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [43]:
obj['b'] # index

1

In [44]:
obj[1] # int

1

In [45]:
obj[2:4]

c    2
d    3
dtype: int32

In [48]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [49]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [50]:
obj[obj<2]

a    0
b    1
dtype: int32

### 用標籤切片的行為和一般Python切片有一點差異，不像一般Python切片排除尾端:

In [53]:
obj['b':'c'] # 一般Python切片，C不會顯示

b    1
c    2
dtype: int32

#### 給值的話，會修改Series中對應的區域:

In [54]:
obj['b':'c']=5

In [55]:
obj

a    0
b    5
c    5
d    3
dtype: int32

### 對DataFrame做索引的話，使用單一值或是序列都可以，可取回一欄或多欄的值:

In [2]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [3]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [4]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [5]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [7]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

### 利用切片選擇資料:

In [8]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

#### [:2]語法做 row 選擇 是一種方便的方法，只要將單一元素或一個lis放到[]中的話，就可選擇指定的欄。

### 布林陣列選擇資料

In [10]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### 布林DataFrame做索引，例如用常數做比較產出的布林DataFrame:
#### 此時DataFrame就更像一個二維NumPy陣列。

In [11]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [12]:
data[data<5]=0 #指定值給符合條件的。

In [13]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

***

## 用 loc 和 iloc 做選擇

loc 和 iloc 是一種特別的索引運算方法，可運用類似NumPy的寫法，配合 軸標籤(loc) 或 整數(iloc) 在DataFrame中選取一些 row 或 columns。

### 用loc選擇一個 row 及多個 columns:

In [15]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

### 用iloc做類似動作:

In [16]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [17]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [18]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

### loc和iloc都支援切片:

In [19]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [20]:
data.iloc[:,:3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [21]:
data.iloc[:,:3][data.three>5] #加入條件

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

![jupyter](./DataFrame的索引方法.PNG)

***

## 算術運算與資料對齊

### 如果配對的index都沒有重複，那麼產出處對應的index，就會是將配對的index做聯集。此動作就像資料庫中做 外部連結(outer join):

In [23]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [24]:
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [25]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [26]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [27]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

#### 內部的資料對齊功能使得在沒有配對的標籤處產生了NA，這些NA會在之後做其他算術運算時將會傳播。

### 使用DataFrame時，全部的欄或列都會進行對齊動作:

In [28]:
df1=pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

In [29]:
df2=pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [30]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [31]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

#### 兩者相加會回傳一個DataFrame，它的index和欄位是原本兩個DataFrame做聯集的結果:

In [32]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 在欄和列中，並非同時兩邊都可以找到的標籤，都會變成NA。

### 若將兩個沒有共同欄標籤或同列標籤的DataFrame物件相加，產出的結果全都為NAN:

In [33]:
df1=pd.DataFrame({'A':[1,2]})

In [34]:
df2=pd.DataFrame({'B':[3,4]})

In [35]:
df1

   A
0  1
1  2

In [36]:
df2

   B
0  3
1  4

In [37]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

***

## 算術運算與填值

### 對兩個index不同的物件進行運算時，可能會想在軸標籤只出現單一物件，而另外一個物件沒有時，可進行填特定值的動作:

In [39]:
df1=pd.DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))

In [40]:
df2=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [41]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [42]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [43]:
df1+df2 #原始

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

#### 加入參數 fill_value:

In [44]:
df1.add(df2,fill_value=0) #用數學方法add，填值為0。

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

### 若對DataFrame重做索引的話，也可指定不同的填入值:

In [45]:
df1.reindex(columns=df2.columns,fill_value=1)

   a  b   c   d  e
0  0  1   2   3  1
1  4  5   6   7  1
2  8  9  10  11  1

![jupyter](./算術運算方法.png)

***

## 在DataFrame和Series之間運算

In [53]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [54]:
series=frame.iloc[0] #第 0 row

In [55]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [56]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

### 在DataFrame和Series間的算術運算，預設行為是將Series的index和DataFrame的欄位做匹配，然後向下面做廣播:

In [57]:
frame-series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

### 若一個index在DataFrame的欄位裡找不到，或是在Series裡找不到，產出的物件會以聯集的結果重做索引:

In [58]:
series2=pd.Series(np.arange(3),index=['b','e','f'])

In [59]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [60]:
series2

b    0
e    1
f    2
dtype: int32

In [61]:
frame-series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

### 如果是想用列index做匹配，對欄做廣播，就要用 "方法" 進行算術運算:

In [62]:
series3=frame['d']

In [63]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [64]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [65]:
frame.sub(series3,axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

#### 傳入的軸編號是要進行匹配的軸，上述例子中，要匹配的是DataFrame的row index(axis='index'或axis=0)，再進行廣播。

***

## apply和applymap

### NumPy的全域函式(ufunc，或元素級別陣列方法)對pandas物件也適用:

In [67]:
frame=pd.DataFrame(np.random.rand(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [68]:
frame

               b         d         e
Utah    0.582220  0.153592  0.192909
Ohio    0.841376  0.558986  0.467022
Texas   0.148885  0.750657  0.072534
Oregon  0.560317  0.843857  0.072805

In [69]:
np.abs(frame) #取絕對值

               b         d         e
Utah    0.582220  0.153592  0.192909
Ohio    0.841376  0.558986  0.467022
Texas   0.148885  0.750657  0.072534
Oregon  0.560317  0.843857  0.072805

### DataFrame的apply方法，是逐欄或逐列套用一個函式:

In [72]:
f=lambda x:x.max()-x.min()

In [73]:
frame.apply(f)

b    0.692491
d    0.690266
e    0.394488
dtype: float64

#### 上述範例為計算一個Series中的最大值和最小值間的差值，此計算會在frame中每一欄都進行一次，產出結果為一個Series，index為原來frame的欄。

#### 許多常見的陣列統計方法(像是sum或mean)，DataFrame都有自己的方法支援。

### 傳給apply函式不一定要回傳常數值，也可以回傳含有多個值得Serise:

In [74]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [75]:
frame.apply(f)

            b         d         e
min  0.148885  0.153592  0.072534
max  0.841376  0.843857  0.467022

### applymap的由來是因為Series有一個叫map的方法，用來對Series在元素級別各別進行的動作。

### 也可用Python的元素級別函式來做:

In [76]:
#將frame中的值都用格式化過的字串表示
#運用applymap
format=lambda x:'%.2f' % x

In [77]:
frame.applymap(format)

           b     d     e
Utah    0.58  0.15  0.19
Ohio    0.84  0.56  0.47
Texas   0.15  0.75  0.07
Oregon  0.56  0.84  0.07

In [78]:
frame['e'].map(format)

Utah      0.19
Ohio      0.47
Texas     0.07
Oregon    0.07
Name: e, dtype: object

***

## 排序

### sort_index方法可依列或欄index照字典序列排序，並回傳新建排好的物件:

In [79]:
obj=pd.Series(range(4),index=['d','a','b','c'])

In [80]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [81]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

### 對DataFrame來說，可指定沿著特性軸排序:

In [83]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])

In [84]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [85]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [86]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

#### 預設是以遞增排序，但也可指定為遞減:

In [87]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 若要對Series的值進行排序，用sort_value方法:

In [89]:
obj=pd.Series([4,7,-3,2])

In [91]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [95]:
obj.sort_values() #左邊為原本的index

2   -3
3    2
0    4
1    7
dtype: int64

#### 遺失值會排在最後:

In [96]:
obj=pd.Series([4,7,-3,np.nan,2])

In [97]:
obj

0    4.0
1    7.0
2   -3.0
3    NaN
4    2.0
dtype: float64

In [98]:
obj.sort_values()

2   -3.0
4    2.0
0    4.0
1    7.0
3    NaN
dtype: float64

### 排序DataFrame時，可指定一或多個欄的資料當作排序鍵值:

In [100]:
frame=pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [101]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [102]:
frame.sort_values(by='b') # 以b欄來排

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

#### 多個欄位進行排序，就傳入欄名稱list:

In [103]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

***

## 排名

#### 排名做的是將一個陣列中的有效資料，從1開始排名次。

### 使用Series或DataFrame的 rank方法:
#### 在碰到一樣大的值時，會採用它們的平均排名值做為該組所有值的排名。

In [104]:
obj=pd.Series([7,-5,7,4,2,0,4])

In [105]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [106]:
obj.rank()  #值是名次

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

#### 利用先出現的值為優先決定排名:

In [107]:
obj.rank(method='first') #值是名次

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

#### 指定降冪排序:

In [108]:
#分組時，指定平手時使用最大排名
obj.rank(ascending=False,method='max')  #值是排名

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

### DataFrame可分別對row或columns進行排名:

In [109]:
frame=pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [110]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [111]:
frame.rank(axis='columns') #值為排名

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

![jupyter](./排名平手時處裡.PNG)

***

## 軸index有重複標籤

### 實際上，標籤並不是不可重複的。

In [112]:
obj=pd.Series(range(5),index=['a','a','b','b','c'])

In [113]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

### index的is_unique屬性可告訴我們標籤是否有重複值:

In [114]:
obj.index.is_unique

False

### 對重複的標籤做索引的話，會回傳一個Series；若是不重複的，則回傳常數:

In [115]:
obj['a']

a    0
a    1
dtype: int64

In [116]:
obj['c']

4

### 同樣的事情在DataFrame的row做索引時，也會發生:

In [117]:
df=pd.DataFrame(np.random.rand(4,3),index=['a','a','b','b'])

In [118]:
df

          0         1         2
a  0.420995  0.200607  0.005965
a  0.497227  0.314425  0.275847
b  0.499331  0.155014  0.765914
b  0.064792  0.425821  0.056649

In [120]:
df.loc['b']

          0         1         2
b  0.499331  0.155014  0.765914
b  0.064792  0.425821  0.056649

***

## 匯總和計算描述性統計量

pnadas物件都配有一套常用的數學和統計方法，大多屬於歸納和匯總統計值，用來從Series和DataFrame的row和columns所乘的Series中取得單一結果值。若跟NumPy陣列的類似功能相比，多了內建遺失值的處裡。

In [122]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [123]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

### DataFrame的sum方法，會回傳含有每欄加總結果的Series:

In [124]:
df.sum()

one    9.25
two   -5.80
dtype: float64

### 若傳入axis='columns'或axis=1就會改為row加總:

In [125]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

### 除非整個切片(整欄或整列)都是NA，不然NA會被排除。可設定skipna選項改變:

In [126]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

![jupyter](./歸納方法的選項.PNG)

### 回傳統計值的index位置，例如idxmin和idxmax回傳的是最小值和最大值的index位置:

In [127]:
df.idxmax()

one    b
two    d
dtype: object

### 累加的方法:

In [128]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

### describe方法，一次產生多種統計值:

In [129]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

#### 若資料不是數值的話，describe會顯示另一種匯總統計:

In [130]:
obj=pd.Series(['a','a','b','b']*4)

In [131]:
obj

0     a
1     a
2     b
3     b
4     a
5     a
6     b
7     b
8     a
9     a
10    b
11    b
12    a
13    a
14    b
15    b
dtype: object

In [132]:
obj.describe()

count     16
unique     2
top        a
freq       8
dtype: object

![jupyter](./描述和匯總統計值.PNG)

***

## 相關係數和共變異數

像是相關係數和共變異數等匯總統計值，是由一些參數計算而來。

### Yahoo! Finance上收集股票價格和成交量的DataFrame當例子:

In [134]:
import pandas_datareader.data as web #套件

In [136]:
#下載幾檔股票行情
all_data={ticker:web.get_data_yahoo(ticker)
         for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [138]:
#價格
price=pd.DataFrame({ticker:data['Adj Close']
                   for ticker,data in all_data.items()})

In [139]:
#成交量
volume=pd.DataFrame({ticker:data['Volume']
                    for ticker,data in all_data.items()})

In [141]:
#計算價格的百分比變化
returns=price.pct_change()

In [142]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-04-01  0.006791  0.015592  0.009157  0.018000
2019-04-02  0.014537 -0.002094  0.001428  0.005073
2019-04-03  0.006855  0.004406  0.006544  0.004523
2019-04-04  0.001740 -0.005918 -0.005085  0.007529
2019-04-05  0.003219 -0.001051  0.003351 -0.001062

#### Series的corr方法用來計算兩個Series中重疊、非NA、按索引對齊的相關性:

In [145]:
returns['MSFT'].corr(returns['IBM'])

0.4885326504532931

#### cov方法則是算共異變數:

In [146]:
returns['MSFT'].cov(returns['IBM'])

8.716479866369133e-05

#### 相對來說，DataFrame的corr和cov方法就會回傳一個DataFrame的相關係數和共異變數的矩陣:

In [148]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.373576  0.452082  0.458406
IBM   0.373576  1.000000  0.488533  0.409041
MSFT  0.452082  0.488533  1.000000  0.537613
GOOG  0.458406  0.409041  0.537613  1.000000

In [149]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000270  0.000076  0.000108  0.000116
IBM   0.000076  0.000152  0.000087  0.000078
MSFT  0.000108  0.000087  0.000210  0.000120
GOOG  0.000116  0.000078  0.000120  0.000237

#### 使用DataFrame的corrwith方法，可計算DataFrame裡面的欄或列跟其他Series或DataFrame之間的變異係數。
#### 將一個Series傳入，結果就會回傳一個Series，其值為傳入的Series與每欄的計算結果:

In [150]:
returns.corrwith(returns.IBM) #IBM為合法的Python屬性

AAPL    0.373576
IBM     1.000000
MSFT    0.488533
GOOG    0.409041
dtype: float64

#### 如果是傳入一個DataFrame的話，就會對名稱相同的欄，進行變異係數值運算。
#### 下列為計算股價百分比變化和成交量的變異係數:

In [151]:
returns.corrwith(volume)

AAPL   -0.061200
IBM    -0.152661
MSFT   -0.089582
GOOG   -0.018001
dtype: float64

***

## 不重複值、個數計算和成員關係

有一群有關的方法群組，是用來取得一維Series中資料的資訊。

In [152]:
obj=pd.Series(['c','a','d','a','a','b','b','c','c'])

### 函式unique能取得Series中的不重複值:

In [153]:
uniques=obj.unique()

In [154]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

### value_counts用來計算Series中值的出現次數:

In [156]:
obj.value_counts() #會由次數多的排下來

c    3
a    3
b    2
d    1
dtype: int64

### 頂層pandas中也有value_counts，可用在任意陣列或序列上:

In [157]:
pd.value_counts(obj.values,sort=False)

b    2
d    1
a    3
c    3
dtype: int64

### isin功能是進行向量化的集合成員檢查，過濾出Series中某些值的子集，或是DataFrame中某些所成的子集時相當好用:

In [158]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [159]:
mask=obj.isin(['b','c'])

In [160]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [161]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### 和isin相關的，還有Index.get_indexer方法，幫助你產生一個index值陣列，其中的index值代表一個具重複值陣列中的元素，在另外一個不重複值陣列中的元素索引:

In [162]:
to_match=pd.Series(['c','a','b','b','c','a'])

In [163]:
unique_vals=pd.Series(['c','b','a'])

In [166]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

![jupyter](./不重複值、個數計算和成員關係方法.PNG)

### 某些情況下，或許想要為DataFrame計算多個欄的直方圖:

In [167]:
data=pd.DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})

In [168]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

#### 將pandas.value_counts傳到DataFrame的apply函式中:

In [170]:
result=data.apply(pd.value_counts).fillna(0)

In [171]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0